app/controllers/admin_controller.rb

SELECT "users".* FROM "users"
---
	def list_of_users
    @users = User.all