app/controllers/books_controller.rb

  def index
		num = 5

    if params[:request]!= nil or params[:available]=="1" then
			search
			@listing =	@books.count%num == 0? @books.count/num : @books.count/num+1
			listing_search num
			@search = params[:request]
			@search_available = params[:available]
		else
			listing num
			@listing =	Book.count%num == 0? Book.count/num : Book.count/num+1
---
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE ("books"."id" = 980190962) LIMIT 1

  def edit
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE ("books"."id" = 298486374) LIMIT 1

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("updated_at", "title", "price", "available", "autor", "created_at") VALUES ('2010-12-07 08:49:37.273379', 'Социалогия коммуникаций', 352.22, 't', 'Соколова П.Р.', '2010-12-07 08:49:37.273379')

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT "books".* FROM "books" WHERE ("books"."id" = 298486374) LIMIT 1
UPDATE "books" SET "updated_at" = '2010-12-07 08:51:19.402765', "title" = 'Образ компании', "autor" = 'Мещанинов А.А', "price" = 31.52 WHERE ("books"."id" = 298486374)

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT "books".* FROM "books" WHERE ("books"."id" = 298486374) LIMIT 1
DELETE FROM "books" WHERE ("books"."id" = 298486374)