app/controllers/orders_controller.rb

  def index
		if current_user.is_admin?
			@orders = Order.all
---
SELECT "orders".* FROM "orders" WHERE ("orders".user_id = 227792459)

  def show
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE ("orders"."id" = 980190963) LIMIT 1

  def edit
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE ("orders"."id" = 980190963) LIMIT 1

  def create
		params[:order][:user_id] = current_user.id
		params[:order][:date] = Time.now
		@order = Order.new(params[:order])
		@cart = find_cart
		@order.books = @cart.books
	  respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("user_id", "updated_at", "date", "delivery", "status", "created_at", "payment", "sum") VALUES (135138680, '2010-12-13 12:55:00.419389', '2010-12-13 12:55:00.395370', 'delivery', 'status', '2010-12-13 12:55:00.419389', 'payment', 851.72)

  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])
---
SELECT "orders".* FROM "orders" WHERE ("orders"."id" = 980190963) LIMIT 1
UPDATE "orders" SET "payment" = 'new_payment', "updated_at" = '2010-12-13 12:35:44.819951' WHERE ("orders"."id" = 980190963)

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE ("orders"."id" = 980190963) LIMIT 1
DELETE FROM "orders" WHERE ("orders"."id" = 980190963)